###############################################################
# 5. 최대공약수 구하기
###############################################################

# 5-0-1 최대공약수 구하기
def c5_0_1(a, b):
    i = min(a, b)
    while True:
        if a % i == 0 and b % i == 0:
            return i
        i -= 1

print(c5_0_1(4, 24))

# 5-0-2 최대공약수 구하기 with 유클리드 알고리즘
def c5_0_2(a, b):
    if b == 0:
        return a
    return c5_0_2(b, a % b)

print(c5_0_2(2, 6))

# 5-1 피보나치
def c5_1(n):
#   print(n)
    if n <= 1:
        return n
    else:
        return c5_1(n - 1) + c5_1(n - 2)
    
print(c5_1(7))